blog/app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "body", "created_at", "updated_at", "status") VALUES (?, ?, ?, ?, ?)  [["title", "swyrgsg"], ["body", "sergesgsegesgesg"], ["created_at", "2023-06-19 23:05:22.874047"], ["updated_at", "2023-06-19 23:05:22.874047"], ["status", "public"]]
---
  def create
    @article = Article.new( article_params )

    if @article.save

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "Testing!!!!"], ["updated_at", "2023-06-19 22:15:46.494916"], ["id", 2]]
---
  def update
    @article = Article.find( params[:id] )

    if @article.update( article_params )