blog/app/controllers/comments_controller.rb

    def create
        @article = Article.find( params[:article_id] )
        @comment = @article.comments.create( comment_params )
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at", "status") VALUES (?, ?, ?, ?, ?, ?)  [["commenter", "awefwfw"], ["body", "wefw"], ["article_id", 1], ["created_at", "2023-06-19 22:59:24.678205"], ["updated_at", "2023-06-19 22:59:24.678205"], ["status", "private"]]

    def destroy
        @article = Article.find( params[:article_id] )
        @comment = @article.comments.find( params[:id] )
        @comment.destroy
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ? AND "comments"."id" = ? LIMIT ?  [["article_id", 1], ["id", 1], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]